/* 第2章　STP

問１　以下の冗長構成において、ルートブリッジに該当するスイッチの番号を答えてください。
　　　なお、各スイッチのブリッジプライオリティは以下とします。

答え　Switch3　※ブリッジプライオリティが1番小さいから


問２　問1に追加して、全てのポートの役割を答えてください。
　　　また、各回答の理由を併せて明記してください。

答え

【Switch1】
	F0/1 = DP
		Switch2のF0/1がRPなので対向するSwitch1のF0/1はDR(指定ポート)となる。

	F0/2 = RP
		F0/2(パスコスト＝19)はF0/1(パスコスト＝19＋19＋100)と比べてパスコストが
		小さいのでRP(ルートポート)。
		
【Switch2】
	F0/1 = RP
		F0/1(パスコスト＝19 + 19)はF0/2(パスコスト＝19＋100)と比べてパスコスト
		が小さいのでRP(ルートポート)。	

	F0/2 = DP
		Switch4のE0/1がRPなので対向するSwitch2のF0/2はDP(指定ポート)となる。

【Switch3】
	ルートブリッジになるのでE0/1, E0/2　両方DP（指定ポート）になる。

【Switch4】
	E0/1 = RP
		Switch2のF0/2がDPなので対向するSwitch4のE0/1はRP(ルートポート)となる。

	E0/2 = BP
		RP, DPのどちらにも当てはまらないのでBP（ブロッキングポート）となる。

		*/