/* 第2章　STP

問１　以下の冗長構成において、ルートブリッジに該当するスイッチの番号を答えてください。
　　　なお、各スイッチのブリッジプライオリティは以下とします。

答え　Switch3　※ブリッジプライオリティが1番小さいから


問２　問1に追加して、全てのポートの役割を答えてください。
　　　また、各回答の理由を併せて明記してください。

答え

【Switch1】
	F0/1 = DP
		Switch2のF0/1がRPなので対向するSwitch1のF0/1はDR(指定ポート)となる。

	F0/2 = RP
		F0/2(パスコスト＝19)はF0/1(パスコスト＝19＋19＋100)と比べてパスコストが
		小さいのでRP(ルートポート)。
		
【Switch2】
	F0/1 = RP
		F0/1(パスコスト＝19 + 19)はF0/2(パスコスト＝19＋100)と比べてパスコスト
		が小さいのでRP(ルートポート)。	

	F0/2 = BP
		RP・DPに選出されてないのでBP(ブロッキングポート)

【Switch3】
	ルートブリッジになるのでE0/1, E0/2　両方DP（指定ポート）になる。

【Switch4】
	E0/1 = DP
		Switch2(20481)とSwitch4(8193)のブリッジIDを比較した時、Switch4の方が
		小さいのでDP(指定ポート)。

	E0/2 = RP
		E0/2(パスコスト＝100)はE0/1(パスコスト＝100＋19＋19)と比べてパスコスト
		が小さいのでRP(ルートポート)。

		*/